# Сообщить в какой четверти координатной плоскости или на какой оси находится точка с координатами Х и У
while True:
    x = int(input('Введите координату x: '))
    y = int(input('Введите координату y: '))

    if x > 0 and y > 0:
        print("точка (", x, ",", y, ") лежит в первом квадранте")

    elif x < 0 and y > 0:
        print("точка (", x, ",", y, ") лежит во втором квадранте")

    elif x < 0 and y < 0:
        print("точка (", x, ",", y, ") лежит в третьем квадранте")

    elif x > 0 and y < 0:
        print("точка (", x, ",", y, ") лежит в четвертом квадранте")

    elif x == 0 and y == 0:
        print("точка (", x, ",", y, ") лежит на начале координат")

    elif y == 0 and x != 0:
        print("точка (", x, ",", y, ") на x-оси")

    elif x == 0 and y != 0:
        print("точка (", x, ",", y, ") на y-оси")

    else:
        print('ошибка')
