"""
Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной
последовательности.
"""
dummy_data = [1, 1, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9]
print(list(set(dummy_data)))
